In [2]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')  # esto es para quitar prints

pd.set_option('display.max_columns', None)   # mostrar todas las columnas del df
#pd.set_option('display.max_rows', None)   # mostrar todas las filas del df

## 1. Importamos todos los csv y les damos un nombre para cada dataframe que creemos.

In [3]:
df_actor=pd.read_csv('../data/actor.csv')
df_actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [4]:
df_category=pd.read_csv('../data/category.csv')
df_category.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [5]:
df_film=pd.read_csv('../data/film.csv')
df_film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [6]:
df_inventory=pd.read_csv('../data/inventory.csv')
df_inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [7]:
df_language=pd.read_csv('../data/language.csv')
df_language.head()

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [8]:
df_old_HDD=pd.read_csv('../data/old_HDD.csv')
df_old_HDD.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [9]:
df_rental=pd.read_csv('../data/rental.csv')
df_rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [10]:
df_rental.inventory_id.value_counts().head()

367     1
1769    1
1414    1
2247    1
2968    1
Name: inventory_id, dtype: int64

## 2. Limpieza df_actor

In [11]:
df_actor.info(memory_usage='deep') #comprobamos el tipo de dato y el número de nulos por columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 41.0 KB

In [12]:
df_actor.last_update.unique() #check de los valores únicos de cada columna

array(['2006-02-15 04:34:33'], dtype=object)

In [13]:
df_actor.last_update=pd.to_datetime(df_actor.last_update, format='%Y-%m-%d') #convertimos a tipo fecha la columna last_update

type(df_actor.last_update[0])

pandas._libs.tslibs.timestamps.Timestamp

In [14]:
#me quito la columna last_update porque sólo tiene un valor único y no aporta nada.
df_actor.drop(['last_update'], axis=1, inplace=True)

In [15]:
#Capitalizamos las columnas de nombre y apellidos
df_actor[['first_name', 'last_name']] = df_actor[['first_name', 'last_name']].apply(lambda col: col.str.capitalize())
df_actor.head()

   actor_id first_name     last_name
0         1   Penelope       Guiness
1         2       Nick      Wahlberg
2         3         Ed         Chase
3         4   Jennifer         Davis
4         5     Johnny  Lollobrigida

In [16]:
df_actor.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   actor_id    200 non-null    int64
 1   first_name  200 non-null    object
 2   last_name   200 non-null    object
dtypes: int64(1), object(2)
memory usage: 26.2 KB

In [17]:
df_actor.duplicated().any() #comprobamos valores duplicados

False

In [18]:
for c in df_actor.select_dtypes('integer').columns: #hacemos un downcast a las columna integer para reducir espacio en memoria
    
    df_actor[c]=pd.to_numeric(df_actor[c], downcast='integer')
    
df_actor.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   actor_id    200 non-null    int16
 1   first_name  200 non-null    object
 2   last_name   200 non-null    object
dtypes: int16(1), object(2)
memory usage: 25.0 KB

In [20]:
df_actor["full_name"] = df_actor["first_name"] + ' ' + df_actor["last_name"] #creo nueva columna concatenando nombre y apellidos.
df_actor.full_name.head()

0       Penelope Guiness
1          Nick Wahlberg
2               Ed Chase
3         Jennifer Davis
4    Johnny Lollobrigida
Name: full_name, dtype: object

In [21]:
df_actor.head()

   actor_id first_name     last_name            full_name
0         1   Penelope       Guiness     Penelope Guiness
1         2       Nick      Wahlberg        Nick Wahlberg
2         3         Ed         Chase             Ed Chase
3         4   Jennifer         Davis       Jennifer Davis
4         5     Johnny  Lollobrigida  Johnny Lollobrigida

## 3. df_category

In [22]:
df_category.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [23]:
df_category.info(memory_usage='deep') #comprobamos el tipo de dato y el número de nulos por columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 2.4 KB

In [24]:
df_category #No vamos a hacer capitalize de name porque Sci_Fi está bien escrito así. Es una excepción.

    category_id         name          last_update
0             1       Action  2006-02-15 04:46:27
1             2    Animation  2006-02-15 04:46:27
2             3     Children  2006-02-15 04:46:27
3             4     Classics  2006-02-15 04:46:27
4             5       Comedy  2006-02-15 04:46:27
5             6  Documentary  2006-02-15 04:46:27
6             7        Drama  2006-02-15 04:46:27
7             8       Family  2006-02-15 04:46:27
8             9      Foreign  2006-02-15 04:46:27
9            10        Games  2006-02-15 04:46:27
10           11       Horror  2006-02-15 04:46:27
11           12        Music  2006-02-15 04:46:27
12           13          New  2006-02-15 04:46:27
13           14       Sci-Fi  2006-02-15 04:46:27
14           15       Sports  2006-02-15 04:46:27
15           16       Travel  2006-02-15 04:46:27

In [25]:
#me quito la columna last_update porque sólo tiene un valor único y no aporta nada.
df_category.drop(['last_update'], axis=1, inplace=True)

In [26]:
for c in df_category.select_dtypes('integer').columns: #hacemos un downcast a las columna integer para reducir espacio en memoria
    
    df_category[c]=pd.to_numeric(df_category[c], downcast='integer')
    
df_category.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int8
 1   name         16 non-null     object
dtypes: int8(1), object(1)
memory usage: 1.1 KB

## 4. df_film

In [27]:
df_film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [28]:
df_film.info(memory_usage='deep') #comprobamos el tipo de dato y el número de nulos por columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 495.3 KB

In [29]:
df_film.release_year.unique() #vamos a borrar las columnas release year y last_update

array([2006], dtype=int64)

In [30]:
df_film.drop(['last_update'], axis=1, inplace=True) 
df_film.drop(['release_year'], axis=1, inplace=True)

In [31]:
#Capitalizamos las columnas de título, descripción y special_features
df_film[['title', 'description', 'special_features']] = df_film[['title', 'description', 'special_features']].apply(lambda col: col.str.capitalize())
df_film.head()

,film_id,title,description,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,Academy dinosaur,A epic drama of a feminist and a mad scientist...,1,NaN,6,0.99,86,20.99,PG,"Deleted scenes,behind the scenes"
1,2,Ace goldfinger,A astounding epistle of a database administrat...,1,NaN,3,4.99,48,12.99,G,"Trailers,deleted scenes"
2,3,Adaptation holes,A astounding reflection of a lumberjack and a ...,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,deleted scenes"
3,4,Affair prejudice,A fanciful documentary of a frisbee and a lumb...,1,NaN,5,2.99,117,26.99,G,"Commentaries,behind the scenes"
4,5,African egg,A fast-paced documentary of a pastry chef and ...,1,NaN,6,2.99,130,22.99,G,Deleted scenes

In [32]:
df_film.info(memory_usage='deep') #comprobamos el tipo de dato y el número de nulos por columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   language_id           1000 non-null   int64
 4   original_language_id  0 non-null      float64
 5   rental_duration       1000 non-null   int64
 6   rental_rate           1000 non-null   float64
 7   length                1000 non-null   int64
 8   replacement_cost      1000 non-null   float64
 9   rating                1000 non-null   object
 10  special_features      1000 non-null   object
dtypes: float64(3), int64(4), object(4)
memory usage: 413.3 KB

In [33]:
#elimino también la columna de original_language_id por ser todo nulos
df_film.drop(['original_language_id'], axis=1, inplace=True)

In [34]:
df_film.info(memory_usage='deep') #comprobamos el tipo de dato y el número de nulos por columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int64
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   language_id       1000 non-null   int64
 4   rental_duration   1000 non-null   int64
 5   rental_rate       1000 non-null   float64
 6   length            1000 non-null   int64
 7   replacement_cost  1000 non-null   float64
 8   rating            1000 non-null   object
 9   special_features  1000 non-null   object
dtypes: float64(2), int64(4), object(4)
memory usage: 405.5 KB

In [35]:
df_film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,Academy dinosaur,A epic drama of a feminist and a mad scientist...,1,6,0.99,86,20.99,PG,"Deleted scenes,behind the scenes"
1,2,Ace goldfinger,A astounding epistle of a database administrat...,1,3,4.99,48,12.99,G,"Trailers,deleted scenes"
2,3,Adaptation holes,A astounding reflection of a lumberjack and a ...,1,7,2.99,50,18.99,NC-17,"Trailers,deleted scenes"
3,4,Affair prejudice,A fanciful documentary of a frisbee and a lumb...,1,5,2.99,117,26.99,G,"Commentaries,behind the scenes"
4,5,African egg,A fast-paced documentary of a pastry chef and ...,1,6,2.99,130,22.99,G,Deleted scenes

In [36]:
df_film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,Academy dinosaur,A epic drama of a feminist and a mad scientist...,1,6,0.99,86,20.99,PG,"Deleted scenes,behind the scenes"
1,2,Ace goldfinger,A astounding epistle of a database administrat...,1,3,4.99,48,12.99,G,"Trailers,deleted scenes"
2,3,Adaptation holes,A astounding reflection of a lumberjack and a ...,1,7,2.99,50,18.99,NC-17,"Trailers,deleted scenes"
3,4,Affair prejudice,A fanciful documentary of a frisbee and a lumb...,1,5,2.99,117,26.99,G,"Commentaries,behind the scenes"
4,5,African egg,A fast-paced documentary of a pastry chef and ...,1,6,2.99,130,22.99,G,Deleted scenes

In [37]:
df_film.info(memory_usage='deep') #comprobamos el tipo de dato y el número de nulos por columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int64
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   language_id       1000 non-null   int64
 4   rental_duration   1000 non-null   int64
 5   rental_rate       1000 non-null   float64
 6   length            1000 non-null   int64
 7   replacement_cost  1000 non-null   float64
 8   rating            1000 non-null   object
 9   special_features  1000 non-null   object
dtypes: float64(2), int64(4), object(4)
memory usage: 405.5 KB

In [38]:
for c in df_film.select_dtypes('integer').columns: #hacemos un downcast a las columna integer para reducir espacio en memoria
    
    df_film[c]=pd.to_numeric(df_film[c], downcast='integer')
    
df_film.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int16
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   language_id       1000 non-null   int8
 4   rental_duration   1000 non-null   int8
 5   rental_rate       1000 non-null   float64
 6   length            1000 non-null   int16
 7   replacement_cost  1000 non-null   float64
 8   rating            1000 non-null   object
 9   special_features  1000 non-null   object
dtypes: float64(2), int16(2), int8(2), object(4)
memory usage: 380.1 KB

In [39]:
for c in df_film.select_dtypes('float').columns: #hacemos un downcast a las columnas float para reducir espacio en memoria
    
    df_film[c]=pd.to_numeric(df_film[c], downcast='float')
    
df_film.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int16
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   language_id       1000 non-null   int8
 4   rental_duration   1000 non-null   int8
 5   rental_rate       1000 non-null   float32
 6   length            1000 non-null   int16
 7   replacement_cost  1000 non-null   float32
 8   rating            1000 non-null   object
 9   special_features  1000 non-null   object
dtypes: float32(2), int16(2), int8(2), object(4)
memory usage: 372.2 KB

In [40]:
df_film.rating.unique()

array(['PG', 'G', 'NC-17', 'PG-13', 'R'], dtype=object)

## 5. df_inventory

In [41]:
df_inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [42]:
df_inventory.info(memory_usage='deep') #comprobamos el tipo de dato y el número de nulos por columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 97.8 KB

In [43]:
df_inventory.drop(['last_update'], axis=1, inplace=True) #borramos la columna last_update por tener un único valor único

In [44]:
df_inventory.info(memory_usage='deep') #comprobamos el tipo de dato y el número de nulos por columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
dtypes: int64(3)
memory usage: 23.6 KB

In [45]:
for c in df_inventory.select_dtypes('integer').columns: #hacemos un downcast a las columna integer para reducir espacio en memoria
    
    df_inventory[c]=pd.to_numeric(df_inventory[c], downcast='integer')
    
df_inventory.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int16
 1   film_id       1000 non-null   int16
 2   store_id      1000 non-null   int8
dtypes: int16(2), int8(1)
memory usage: 5.0 KB

## 6. df_language

In [46]:
df_language

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

In [47]:
df_language.info(memory_usage='deep') #comprobamos el tipo de dato y el número de nulos por columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int64
 1   name         6 non-null      object
 2   last_update  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 1016.0 bytes

In [48]:
df_language.drop(['last_update'], axis=1, inplace=True) #borramos la columna last_update por tener un único valor único

In [49]:
for c in df_language.select_dtypes('integer').columns: #hacemos un downcast a las columna integer para reducir espacio en memoria
    
    df_language[c]=pd.to_numeric(df_language[c], downcast='integer')
    
df_language.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int8
 1   name         6 non-null      object
dtypes: int8(1), object(1)
memory usage: 518.0 bytes

## 7. df_old_HDD

In [50]:
df_old_HDD.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [51]:
df_old_HDD.info(memory_usage='deep') #comprobamos el tipo de dato y el número de nulos por columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 207.6 KB

In [52]:
df_old_HDD.release_year.unique()

array([2006], dtype=int64)

In [53]:
df_old_HDD.drop(['release_year'], axis=1, inplace=True) #borramos la columna last_update por tener un único valor único

In [54]:
df_old_HDD.info(memory_usage='deep') #comprobamos el tipo de dato y el número de nulos por columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   first_name   1000 non-null   object
 1   last_name    1000 non-null   object
 2   title        1000 non-null   object
 3   category_id  1000 non-null   int64
dtypes: int64(1), object(3)
memory usage: 199.8 KB

In [55]:
#Capitalizamos las columnas de nombre y apellidos y títulos
df_old_HDD[['first_name', 'last_name', 'title']] = df_old_HDD[['first_name', 'last_name', 'title']].apply(lambda col: col.str.capitalize())
df_old_HDD.head()

  first_name last_name                  title  category_id
0   Penelope   Guiness       Academy dinosaur            6
1   Penelope   Guiness   Anaconda confessions            2
2   Penelope   Guiness            Angels life           13
3   Penelope   Guiness  Bulworth commandments           10
4   Penelope   Guiness          Cheaper clyde           14

In [56]:
for c in df_old_HDD.select_dtypes('integer').columns: #hacemos un downcast a las columna integer para reducir espacio en memoria
    
    df_old_HDD[c]=pd.to_numeric(df_old_HDD[c], downcast='integer')
    
df_old_HDD.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   first_name   1000 non-null   object
 1   last_name    1000 non-null   object
 2   title        1000 non-null   object
 3   category_id  1000 non-null   int8
dtypes: int8(1), object(3)
memory usage: 193.0 KB

In [57]:
df_old_HDD["full_name"] = df_old_HDD["first_name"] + ' ' + df_old_HDD["last_name"] #creo nueva columna concatenando nombre y apellidos.
df_old_HDD.full_name.head()

0    Penelope Guiness
1    Penelope Guiness
2    Penelope Guiness
3    Penelope Guiness
4    Penelope Guiness
Name: full_name, dtype: object

In [77]:
#creamos una nueva columna basándonos en el film_id de film
new_list = []
for d in df_old_HDD.title:
    for i in range(len(df_old_HDD.title)):
        if d == df_film.title[i]:
            new_list.append(df_film.film_id[i])
df_old_HDD['film_id'] = new_list

In [78]:
df_old_HDD.head()

,first_name,last_name,title,category_id,full_name,film_id
0,Penelope,Guiness,Academy dinosaur,6,Penelope Guiness,1
1,Penelope,Guiness,Anaconda confessions,2,Penelope Guiness,23
2,Penelope,Guiness,Angels life,13,Penelope Guiness,25
3,Penelope,Guiness,Bulworth commandments,10,Penelope Guiness,106
4,Penelope,Guiness,Cheaper clyde,14,Penelope Guiness,140

In [80]:
#creamos una nueva columna basándonos en el actor_id de actor
actor_id=[]
for e in df_old_HDD.values:
    for a in df_actor.values:
        if e[0]==a[1] and e[1]==a[2]:
            actor_id.append(a[0])
df_old_HDD['actor_id']=actor_id

In [88]:
df_old_HDD.head()

,first_name,last_name,title,category_id,full_name,film_id,actor_id
0,Penelope,Guiness,Academy dinosaur,6,Penelope Guiness,1,1
1,Penelope,Guiness,Anaconda confessions,2,Penelope Guiness,23,1
2,Penelope,Guiness,Angels life,13,Penelope Guiness,25,1
3,Penelope,Guiness,Bulworth commandments,10,Penelope Guiness,106,1
4,Penelope,Guiness,Cheaper clyde,14,Penelope Guiness,140,1

In [83]:
df_old_HDD.info(memory_usage='deep') #comprobamos el tipo de dato y el número de nulos por columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   first_name   1000 non-null   object
 1   last_name    1000 non-null   object
 2   title        1000 non-null   object
 3   category_id  1000 non-null   int8
 4   full_name    1000 non-null   object
 5   film_id      1000 non-null   int16
 6   actor_id     1000 non-null   int64
dtypes: int16(1), int64(1), int8(1), object(4)
memory usage: 270.2 KB

In [84]:
for c in df_old_HDD.select_dtypes('integer').columns: #hacemos un downcast a las columna integer para reducir espacio en memoria
    
    df_old_HDD[c]=pd.to_numeric(df_old_HDD[c], downcast='integer')
    
df_old_HDD.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   first_name   1000 non-null   object
 1   last_name    1000 non-null   object
 2   title        1000 non-null   object
 3   category_id  1000 non-null   int8
 4   full_name    1000 non-null   object
 5   film_id      1000 non-null   int16
 6   actor_id     1000 non-null   int8
dtypes: int16(1), int8(2), object(4)
memory usage: 263.3 KB

## 8. Rental

In [55]:
df_rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [56]:
df_rental.info(memory_usage='deep') #comprobamos el tipo de dato y el número de nulos por columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 254.0 KB

In [57]:
df_rental.drop(['last_update'], axis=1, inplace=True) #borramos la columna last_update por tener un único valor único

In [58]:
df_rental.rental_date=pd.to_datetime(df_rental.rental_date, format='%Y-%m-%d') #convertimos a tipo fecha la columna rental_date

type(df_rental.rental_date[0])

pandas._libs.tslibs.timestamps.Timestamp

In [59]:
df_rental.return_date=pd.to_datetime(df_rental.return_date, format='%Y-%m-%d') #convertimos a tipo fecha la columna return_date

type(df_rental.return_date[0])

pandas._libs.tslibs.timestamps.Timestamp

In [60]:
df_rental.info(memory_usage='deep') #comprobamos el tipo de dato y el número de nulos por columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   datetime64[ns]
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   datetime64[ns]
 5   staff_id      1000 non-null   int64
dtypes: datetime64[ns](2), int64(4)
memory usage: 47.0 KB

In [61]:
for c in df_rental.select_dtypes('integer').columns: #hacemos un downcast a las columna integer para reducir espacio en memoria
    
    df_rental[c]=pd.to_numeric(df_rental[c], downcast='integer')
    
df_rental.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int16
 1   rental_date   1000 non-null   datetime64[ns]
 2   inventory_id  1000 non-null   int16
 3   customer_id   1000 non-null   int16
 4   return_date   1000 non-null   datetime64[ns]
 5   staff_id      1000 non-null   int8
dtypes: datetime64[ns](2), int16(3), int8(1)
memory usage: 22.6 KB

## 9. Exportar csv

In [74]:
df_actor.to_csv('../data/actor_clean.csv', index=False)

In [63]:
df_category.to_csv('../data/category_clean.csv', index=False)

In [64]:
df_film.to_csv('../data/film_clean.csv', index=False)

In [65]:
df_inventory.to_csv('../data/inventory_clean.csv', index=False)

In [66]:
df_language.to_csv('../data/language_clean.csv', index=False)

In [89]:
df_old_HDD.to_csv('../data/old_HDD_clean.csv', index=False)

In [68]:
df_rental.to_csv('../data/rental_clean.csv', index=False)

## 10. Crear base de datos nueva

In [108]:
# cargar archivo de texto

with open('..\password.txt', 'r') as file:
    pass_=file.readlines()

In [109]:
password = ''.join(pass_)

In [110]:
import mysql.connector as conn

In [111]:
# crear base de datos nueva

conexion=conn.connect(host='localhost', user='root', passwd=password) # conexion al servidor

cursor=conexion.cursor()

cursor.execute('drop database if exists cinema;')

cursor.execute('create database cinema;')

## 11. Procedemos a cargar datos

In [113]:

str_conn=f'mysql+pymysql://root:{password}@localhost:3306/cinema'

cursor=create_engine(str_conn)

In [114]:
from sqlalchemy import create_engine

##### Dado que hemos diseñado primero el esquema antes de cargar los datos, ahora tenemos que llevar un orden específico a la hora de cargarlos para que no haya fallos. Primero cargaremos las tablas que alimenten a otras tablas con alguna foreign key, pero que no sean alimentadas por otras.

In [115]:
df_actor.to_sql(name='actor', con=cursor, if_exists='append', index=False)

200

In [116]:
df_category.to_sql(name='category', con=cursor, if_exists='append', index=False)

16

In [117]:
df_language.to_sql(name='language', con=cursor, if_exists='append', index=False)

6

In [118]:
df_film.to_sql(name='film', con=cursor, if_exists='append', index=False)

1000

In [119]:
df_inventory.to_sql(name='inventory', con=cursor, if_exists='append', index=False)

1000

In [124]:
df_rental.to_sql(name='rental', con=cursor, if_exists='replace', index=False)

1000

In [121]:
df_old_HDD.to_sql(name='old_hdd', con=cursor, if_exists='append', index=False)

1000